{
  "pageHeader": {
    "home": "home",
    "stack": "skills",
    "projects": "projects"
  },
  "navbar": {
    "contact": "contact me",
    "english": "change to english",
    "polish": "change to polish"
  },
  "welcomePage": {
    "presentation": "Hello, I'm {{name}}",
    "bio": "> fullstack developer and musician, combining programming and creativity to create complex digital experiences."
  },
  "projects": {
    "desc": {
      "ableton": "The Ableton Setlist Manager is a React-based client application designed to work in tandem with the Setlist Management Server for managing setlists and controlling playback in Ableton Live. It provides an intuitive user interface for interacting with Ableton Live and accessing real-time updates through WebSocket communication.",
      "fish": "A mobile game for the android platform allowing you to explore an alternative aquatic reality full of monsters and rewards. The gameplay involves walking around the neighborhood and avoiding water monsters, the application was developed using the Google Maps API.",
      "breath": "BreathGuard is a react web application that uses a machine learning model to predict lung cancer risk. The graphical interface is provided through an application written in React. The machine learning model was created and trained as a college credit project.",
      "ascii": "A simple Python application that converts images into cool ASCII art. Converts images of various formats (e.g., JPG, PNG) into text-based ASCII image representation and saves the generated ASCII art to a .txt file.",
      "library": "This is a web application built using React and React Bootstrap that allows you to manage library. All data is stored locally in your browser's Local Storage. It uses a public API, making thousands of books available.",
      "y": "An X-like application consisting of a mobile app, a web app and a backend written in java. Deployment to Azure was done via container registry. We implemented WebSocket allowing real-time comment updates."
    }
  },
  "stack": {
    "frontend": "> Frontend",
    "backend": "> Backend",
    "mobile": "> Mobile",
    "testing": "> Testing",
    "machineLearning": "> Machine Learning & Data Science",
    "devOps": "> DevOps & Cloud",
    "tools": "> Tools & Methodologies",
    "desc": {
      "react": "> javascript library for building user interfaces",
      "reactNative": "> framework for building native apps using react",
      "angular": "> platform for building mobile and desktop web applications",
      "typeScript": "> typed superset of javascript that compiles to plain javascript",
      "cypress": "> end-to-end testing framework for web applications",
      "java": "> high-level programming language used for building applications",
      "springBoot": "> framework for building java-based enterprise applications",
      "jpa": "> java persistence api for database operations",
      ".net": "> framework for building windows applications",
      "python": "> high-level programming language for general-purpose programming",
      "fastAPI": "> modern, fast web framework for building apis with python",
      "postman": "> tool for testing and documenting apis",
      "android": "> mobile operating system developed by google",
      "kotlin": "> modern programming language for android development",
      "jetpackCompose": "> modern toolkit for building native ui on android",
      "scikit-learn": "> machine learning library for python",
      "sciPy": "> python library for scientific computing",
      "azure": "> cloud computing service by microsoft",
      "aws": "> cloud computing service by amazon",
      "kubernetes": "> open-source system for automating deployment, scaling, and management of containerized applications",
      "docker": "> platform for developing, shipping, and running applications in containers",
      "bitbucket": "> git repository management solution",
      "jira": "> project management tool for agile teams",
      "scrum": "> agile framework for managing complex projects",
      "jetBrainsIDEs": "> integrated development environments by jetbrains"
    }
  }
}