{
  "pageHeader": {
    "home": "home",
    "stack": "umiejętności",
    "projects": "projekty"
  },
  "navbar": {
    "contact": "skontaktuj się",
    "english": "zmień język na angielski",
    "polish": "zmień język na polski"
  },
  "welcomePage": {
    "presentation": "Cześć, jestem {{name}}",
    "bio": "> fullstack developer i muzyk, łączący zamiłowanie do programowania i kreatywność, by tworzyć niekonwencjonalne cyfrowe doświadczenia."
  },
  "projects": {
    "desc": {
      "ableton": "Ableton Setlist Manager to oparta na React aplikacja webowa zaprojektowana do współpracy z serwerem Setlist Management Server w celu zarządzania setlistami i kontrolowania odtwarzania w Ableton Live. Zapewnia intuicyjny interfejs użytkownika do interakcji z Ableton Live i uzyskiwania dostępu do aktualizacji w czasie rzeczywistym za pośrednictwem komunikacji WebSocket.",
      "fish": "Gra mobilna na platformę Android pozwalająca odkrywać alternatywną wodną rzeczywistość pełną potworów i nagród. Rozgrywka polega na chodzeniu po okolicy i unikaniu wodnych potworów, aplikacja została stworzona przy użyciu Google Maps API.",
      "breath": "BreathGuard to aplikacja internetowa napisana w technologii React, która wykorzystuje model uczenia maszynowego do przewidywania ryzyka zachorowania na raka płuc. Model uczenia maszynowego został stworzony i przeszkolony w ramach projektu zaliczeniowego.",
      "ascii": "Prosta aplikacja w Pythonie, która konwertuje obrazy na fajną grafikę ASCII. Konwertuje obrazy w różnych formatach (np. JPG, PNG) na tekstową reprezentację ASCII i zapisuje wygenerowaną grafikę ASCII do pliku .txt.",
      "library": "Jest to aplikacja internetowa zbudowana przy użyciu React i React Bootstrap, która pozwala zarządzać biblioteką. Wszystkie dane są przechowywane lokalnie w Local Storage przeglądarki. Korzysta z publicznego API, udostępniając tysiące książek.",
      "y": "Aplikacja podobna do X składająca się z aplikacji mobilnej, aplikacji webowej i backendu napisanego w języku Java. Wdrożenie na platformę Azure odbyło się za pośrednictwem rejestru kontenerów. Zaimplementowaliśmy WebSocket umożliwiający aktualizację komentarzy w czasie rzeczywistym."
    },
  "stack": {
    "stack": "stack technologiczny",
    "frontend": "> Frontend",
    "backend": "> Backend",
    "mobile": "> Aplikacje mobilne",
    "testing": "> Testy",
    "machineLearning": "> Uczenie Maszynowe & Data Science",
    "devOps": "> DevOps & Usługi Chmurowe",
    "tools": "> Narzędzia i metodologie",
    "desc": {
      "react": "> biblioteka javascript do budowania interfejsów użytkownika",
      "reactNative": "> framework do budowania natywnych aplikacji przy użyciu react",
      "angular": "> platforma do tworzenia mobilnych i desktopowych aplikacji internetowych",
      "typeScript": "> typed superset of javascript that compiles to plain javascript",
      "cypress": "> kompleksowy framework do testowania aplikacji internetowych",
      "java": "> język programowania wysokiego poziomu używany do tworzenia aplikacji",
      "springBoot": "> framework do budowania aplikacji korporacyjnych opartych na języku java",
      "jpa": "> java persistence api for database operations",
      ".net": "> framework do budowania aplikacji windowsowych",
      "python": "> język programowania wysokiego poziomu do programowania ogólnego przeznaczenia",
      "fastAPI": "> nowoczesny, szybki framework webowy do budowania apis z pythonem",
      "postman": "> narzędzie do testowania i dokumentowania apis",
      "android": "> mobilny system operacyjny opracowany przez google",
      "kotlin": "> nowoczesny język programowania dla Androida",
      "jetpackCompose": "> nowoczesny zestaw narzędzi do tworzenia natywnego interfejsu użytkownika na Androida",
      "scikit-learn": "> biblioteka uczenia maszynowego dla Pythona",
      "sciPy": "> biblioteka python do obliczeń naukowych",
      "azure": "> usługa przetwarzania w chmurze firmy microsoft",
      "aws": "> usługa przetwarzania w chmurze firmy amazon",
      "kubernetes": "> system open-source do automatyzacji wdrażania, skalowania i zarządzania aplikacjami kontenerowymi",
      "docker": "> platforma do tworzenia, wysyłki i uruchamiania aplikacji w kontenerach",
      "bitbucket": "> rozwiązanie do zarządzania repozytoriami git",
      "jira": "> narzędzie do zarządzania projektami dla zwinnych zespołów",
      "scrum": "> zwinny framework do zarządzania złożonymi projektami",
      "jetBrainsIDEs": "> zintegrowane środowiska programistyczne firmy jetbrains"
    }
  }
}